s = [
  "강원도 고성군",
  "고성군 토성면",
  "토성면 북면",
  "북면",
  "김1수",
  "ㅇㅈㄷㅅㅌ",
];
const con2exp = new Map([
  ["ㄱ", "[ㄱ가-깋]"],
  ["ㄴ", "[ㄴ나-닣]"],
  ["ㄷ", "[ㄷ다-딯]"],
  ["ㄹ", "[ㄹ라-맇]"],
  ["ㅁ", "[ㅁ마-밓]"],
  ["ㅂ", "[ㅂ바-빟]"],
  ["ㅅ", "[ㅅ사-싷]"],
  ["ㅇ", "[ㅇ아-잏]"],
  ["ㅈ", "[ㅈ자-짛]"],
  ["ㅊ", "[ㅊ차-칳]"],
  ["ㅋ", "[ㅋ카-킿]"],
  ["ㅌ", "[ㅌ타-팋]"],
  ["ㅍ", "[ㅍ파-핗]"],
  ["ㅎ", "[ㅎ하-힣]"],
]);
console.log(s.includes("강원도 고성군"));
const searchByKoreanInitialSound = (arr) => {};

const txt2exp = (txt) =>
  txt.split("").reduce((s, i) => (s += con2exp.get(i)), "");
console.log(txt2exp("ㄱㅅ1ㄱ"));
